In [72]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [73]:
data = {
    'Product': ['A', 'B', 'C', 'D', 'E'],
    'Units_Sold': [10, 5, 8, 12, 7],
    'Revenue': [250, 125, 200, 300, 175]
}

In [74]:
df=pd.DataFrame(data)
df

  Product  Units_Sold  Revenue
0       A          10      250
1       B           5      125
2       C           8      200
3       D          12      300
4       E           7      175

In [75]:
tu=df['Units_Sold'].sum()
tm=df['Units_Sold'].std()
print(tu)
print(tm)

42
2.701851217221259

In [76]:
df.transpose()

              0    1    2    3    4
Product       A    B    C    D    E
Units_Sold   10    5    8   12    7
Revenue     250  125  200  300  175

In [84]:
df.loc[0:3:2]

  Product  Units_Sold  Revenue
0       A          10      250
2       C           8      200

In [ ]:
df.drop()

SyntaxError: invalid syntax (1794653466.py, line 1)